In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\thall\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\thall\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\thall\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in c:\users\thall\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in c:\users\thall\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df=pd.dataframe()

AttributeError: module 'pandas' has no attribute 'dataframe'

In [5]:
name=['a','b','c']
city=['x','y','z']
n={'Name1':name, 'city':city}

In [6]:
i=['R1','R2','R3']

In [7]:
df=pd.DataFrame(n)

In [8]:
df

  Name1 city
0     a    x
1     b    y
2     c    z

In [9]:
df=pd.DataFrame(n,index=i)

In [10]:
df

   Name1 city
R1     a    x
R2     b    y
R3     c    z

In [11]:
df.Name1

R1    a
R2    b
R3    c
Name: Name1, dtype: object

In [12]:
age=[40,25,90]

In [13]:
df['age']=age

In [14]:
df

   Name1 city  age
R1     a    x   40
R2     b    y   25
R3     c    z   90

In [15]:
del df['age']

In [16]:
df

   Name1 city
R1     a    x
R2     b    y
R3     c    z

In [17]:
r= np.random.randint(low=1,high=100,size=10)

In [18]:
n= np.random.choice(['A','B','C','D','E','F'],size=10)

In [19]:
c= np.random.choice([40,5,45,56,7,55,0,55,66,0,55,66,1],size=10)

In [20]:
dict1={'x':r,'y':n, 'z':c}

In [21]:
df=pd.DataFrame(dict1)

In [22]:
df

    x  y   z
0  41  B  55
1  18  B  40
2  88  C   0
3  41  A  45
4  25  D   1
5   5  E  40
6  75  B   5
7  10  A  45
8  46  B   5
9  41  D  55

In [23]:
df.head(1)

    x  y   z
0  41  B  55

In [24]:
df.tail()

    x  y   z
5   5  E  40
6  75  B   5
7  10  A  45
8  46  B   5
9  41  D  55

In [25]:
df.describe()

               x          z
count  10.000000  10.000000
mean   39.000000  29.100000
std    26.649995  23.292583
min     5.000000   0.000000
25%    19.750000   5.000000
50%    41.000000  40.000000
75%    44.750000  45.000000
max    88.000000  55.000000